In [1]:
import pandas as pd
import sqlite3
import os

In [2]:
db = sqlite3.connect("Monarchs.db")

In [3]:
df = pd.read_csv(r".\2001 Season Summary.csv")

        #convert pandas to SQL table
df.to_sql("monarchs_2001", db, if_exists="replace")

os.getcwd

C:\Users\Arink\Anaconda3\lib\site-packages\pandas\core\generic.py:2712: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [4]:
schema = pd.read_sql('SELECT * FROM sqlite_master ORDER by name', db)
schema

,type,name,tbl_name,rootpage,sql
0,index,ix_monarchs_2001_index,monarchs_2001,3,"CREATE INDEX ""ix_monarchs_2001_index""ON ""monar..."
1,table,monarchs_2001,monarchs_2001,2,"CREATE TABLE ""monarchs_2001"" (\n""index"" INTEGE..."

In [5]:
data_type = pd.read_sql('SELECT * FROM PRAGMA_TABLE_INFO("monarchs_2001")', db)
data_type

   cid                   name     type  notnull dflt_value  pk
0    0                  index  INTEGER        0       None   0
1    1                Tag No.     TEXT        0       None   0
2    2                 Tagger     TEXT        0       None   0
3    3    Tag  Location, Date     TEXT        0       None   0
4    4  Report Date, Location     TEXT        0       None   0
5    5               Reporter     TEXT        0       None   0
6    6                  Miles     TEXT        0       None   0

In [6]:
df.drop(["Tagger", "Reporter"], axis = 1, inplace = True)
df

,Tag No.,"Tag Location, Date","Report Date, Location",Miles
0,AAD929,"Salisbury, MA 09-12-01","02-11-02 El Rosario, MICH, MX",2344
1,AAD844,"Salisbury, MA 09-12-01","03-08-02 Sierra Chincua, MICH, MX",2343
2,AIO261,"Champlain, NY 09-24-01","03-13-02 El Rosario, MICH, MX",2329
3,AAU820,"Plattsburgh, NY 08-29-01","02-27-02 El Rosario, MICH, MX",2315
4,ABG581,"Saranac Lake, NY 09-16-01","03-13-02 El Rosario, MICH, MX",2303
...,...,...,...,...
1957,ADE225,?,"10-06-01 Lakeville, MN",?
1958,ABW153,?,"03-08-02 Sierra Chincua, MICH, MX",?
1959,AJA875,?,"02-26-02 El Rosario, MICH, MX",?
1960,ADR234,?,"02-26-02 El Rosario, MICH, MX",?
1961,AAG669,?,"09-16-01 Guilford, CT",?